# Temperature Data
This notebook is meant to extract useful temperature information from multiple weather stations.

In [1]:
# Reading the temperature information
import pandas as pd
temperature = pd.read_csv(r"C:\Users\singh\Desktop\TUD (All Semesters)\Courses - Semester 6 (TU Dresden)\Thesis Work\Dataset\GEFCom2012\GEFCOM2012_Data\Load\temperature_history.csv")
temperature.head()

,station_id,year,month,day,h1,h2,h3,h4,h5,h6,...,h15,h16,h17,h18,h19,h20,h21,h22,h23,h24
0,1,2004,1,1,46,46,45,41,39,35,...,55.0,55.0,52.0,46.0,40.0,40.0,39.0,38.0,40.0,41.0
1,1,2004,1,2,43,44,46,46,47,47,...,54.0,56.0,57.0,53.0,50.0,47.0,46.0,45.0,45.0,45.0
2,1,2004,1,3,45,46,46,44,43,46,...,69.0,68.0,68.0,65.0,64.0,63.0,62.0,63.0,63.0,62.0
3,1,2004,1,4,63,62,62,62,60,60,...,71.0,72.0,71.0,68.0,67.0,67.0,65.0,64.0,65.0,64.0
4,1,2004,1,5,64,63,65,64,64,64,...,66.0,66.0,66.0,66.0,63.0,54.0,52.0,49.0,47.0,47.0

Load data is missing from 6 Mar 2005 - 12 Mar 2005

In [2]:
# Checking if temperature data is available for missing interval or not - station 1
temperature.loc[(temperature.station_id == 1) & (temperature.year == 2005) & (temperature.month == 3) & (temperature.day >= 6)].head()

,station_id,year,month,day,h1,h2,h3,h4,h5,h6,...,h15,h16,h17,h18,h19,h20,h21,h22,h23,h24
430,1,2005,3,6,34,34,31,34,34,34,...,51.0,53.0,55.0,55.0,53.0,52.0,51.0,52.0,51.0,47.0
431,1,2005,3,7,47,45,44,43,44,42,...,64.0,62.0,63.0,59.0,56.0,51.0,51.0,52.0,55.0,56.0
432,1,2005,3,8,56,54,53,54,53,54,...,31.0,31.0,35.0,36.0,35.0,34.0,34.0,32.0,31.0,31.0
433,1,2005,3,9,30,29,28,28,28,26,...,38.0,39.0,39.0,39.0,36.0,33.0,30.0,30.0,29.0,31.0
434,1,2005,3,10,31,32,31,29,29,29,...,42.0,42.0,44.0,41.0,38.0,37.0,36.0,36.0,36.0,38.0

In [3]:
# Checking if temperature data is available for missing interval or not - station 2
temperature.loc[(temperature.station_id == 2) & (temperature.year == 2005) & (temperature.month == 3) & (temperature.day >= 6)].head()

,station_id,year,month,day,h1,h2,h3,h4,h5,h6,...,h15,h16,h17,h18,h19,h20,h21,h22,h23,h24
2073,2,2005,3,6,30,31,31,34,31,33,...,52.0,55.0,56.0,56.0,55.0,54.0,52.0,48.0,49.0,47.0
2074,2,2005,3,7,47,47,45,45,43,37,...,65.0,66.0,66.0,64.0,62.0,61.0,58.0,57.0,58.0,57.0
2075,2,2005,3,8,56,55,54,49,48,46,...,34.0,32.0,32.0,30.0,28.0,27.0,27.0,26.0,26.0,25.0
2076,2,2005,3,9,25,25,24,25,25,24,...,34.0,36.0,37.0,37.0,35.0,32.0,25.0,27.0,28.0,27.0
2077,2,2005,3,10,26,25,24,23,23,22,...,41.0,42.0,43.0,42.0,41.0,38.0,37.0,37.0,36.0,35.0

Data for temperature is available, where load data is missing. Temperature data is only missing in the forecasting horizon as shown below. <br>
Forecasting horizon: Jul 2008

In [4]:
# Checking if temperature data is available for forecasting horizon or not (June 30, 2008) - station 1
temperature.loc[(temperature.station_id == 1) & (temperature.year == 2008) & (temperature.month == 6)& (temperature.day >= 30)].head()

,station_id,year,month,day,h1,h2,h3,h4,h5,h6,...,h15,h16,h17,h18,h19,h20,h21,h22,h23,h24
1642,1,2008,6,30,74,74,74,74,74,75,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [5]:
# Checking if temperature data is available for forecasting horizon or not (July 01, 2008) - station 1
temperature.loc[(temperature.station_id == 1) & (temperature.year == 2008) & (temperature.month == 7)& (temperature.day >= 1)].head()

Empty DataFrame
Columns: [station_id, year, month, day, h1, h2, h3, h4, h5, h6, h7, h8, h9, h10, h11, h12, h13, h14, h15, h16, h17, h18, h19, h20, h21, h22, h23, h24]
Index: []

[0 rows x 28 columns]

## Converting into long form

In [6]:
# Generating a long format for temperature 
temperature_long = temperature.melt(
                id_vars=["station_id","year","month","day"],
                value_vars=[f"h{i}" for i in range(1, 25)],
                var_name="hour",
                value_name="temperature"
                        )

temperature_long.head()

   station_id  year  month  day hour  temperature
0           1  2004      1    1   h1         46.0
1           1  2004      1    2   h1         43.0
2           1  2004      1    3   h1         45.0
3           1  2004      1    4   h1         63.0
4           1  2004      1    5   h1         64.0

In [7]:
# Generating timestamp date from the available time information

temperature_long["date"]=pd.to_datetime(
    temperature_long["year"].astype(str) + "-" +
    temperature_long["month"].astype(str).str.zfill(2) + "-" +
    temperature_long["day"].astype(str).str.zfill(2) + " " 
)

temperature_long.head()

   station_id  year  month  day hour  temperature       date
0           1  2004      1    1   h1         46.0 2004-01-01
1           1  2004      1    2   h1         43.0 2004-01-02
2           1  2004      1    3   h1         45.0 2004-01-03
3           1  2004      1    4   h1         63.0 2004-01-04
4           1  2004      1    5   h1         64.0 2004-01-05

In [8]:
# Mapping hour values
hour_map = {f"h{i}": f"{str(i-1).zfill(2)}:30" for i in range(1, 25)}

# Replace the values using .map()
temperature_long["hour"] = temperature_long["hour"].map(hour_map)
temperature_long.head()

   station_id  year  month  day   hour  temperature       date
0           1  2004      1    1  00:30         46.0 2004-01-01
1           1  2004      1    2  00:30         43.0 2004-01-02
2           1  2004      1    3  00:30         45.0 2004-01-03
3           1  2004      1    4  00:30         63.0 2004-01-04
4           1  2004      1    5  00:30         64.0 2004-01-05

In [9]:
# Creating timestamp from available time information

temperature_long["timestamp"] = pd.to_datetime(
    temperature_long["year"].astype(str) + "-" +
    temperature_long["month"].astype(str).str.zfill(2) + "-" +
    temperature_long["day"].astype(str).str.zfill(2) + " " +
    temperature_long["hour"]
)

temperature_long = temperature_long.sort_values(by="timestamp").reset_index(drop=True)
temperature_long.head()

,station_id,year,month,day,hour,temperature,date,timestamp
0,1,2004,1,1,00:30,46.0,2004-01-01,2004-01-01 00:30:00
1,8,2004,1,1,00:30,43.0,2004-01-01,2004-01-01 00:30:00
2,9,2004,1,1,00:30,41.0,2004-01-01,2004-01-01 00:30:00
3,10,2004,1,1,00:30,42.0,2004-01-01,2004-01-01 00:30:00
4,11,2004,1,1,00:30,36.0,2004-01-01,2004-01-01 00:30:00

In [10]:
# Removing columns and re-ordering

temperature_long = temperature_long[["station_id", "temperature", "timestamp"]]
temperature_long = temperature_long.sort_values(by=["timestamp", "station_id"]).reset_index(drop=True)
temperature_long.head()

   station_id  temperature           timestamp
0           1         46.0 2004-01-01 00:30:00
1           2         38.0 2004-01-01 00:30:00
2           3         44.0 2004-01-01 00:30:00
3           4         45.0 2004-01-01 00:30:00
4           5         42.0 2004-01-01 00:30:00

## Converting into a matrix
Developing a timestamp (row) vs station (column) matrix

In [11]:
# Using pivot on timestamp as index
temperature_matrix = temperature_long.pivot(index="timestamp", columns="station_id", values="temperature")
temperature_matrix.head()

station_id,1,2,3,4,5,6,7,8,9,10,11
timestamp,,,,,,,,,,,
2004-01-01 00:30:00,46.0,38.0,44.0,45.0,42.0,44.0,45.0,43.0,41.0,42.0,36.0
2004-01-01 01:30:00,46.0,36.0,42.0,43.0,42.0,43.0,44.0,44.0,39.0,43.0,32.0
2004-01-01 02:30:00,45.0,35.0,40.0,41.0,40.0,42.0,41.0,42.0,36.0,43.0,31.0
2004-01-01 03:30:00,41.0,30.0,36.0,37.0,39.0,38.0,40.0,34.0,35.0,39.0,30.0
2004-01-01 04:30:00,39.0,30.0,34.0,33.0,40.0,38.0,35.0,30.0,33.0,35.0,34.0

Now for every timestamp, a linear combination of temperature from different station ids can be used.

## PCA
PC1 can capture general temperature reading across stations, while subsequent PCs can capture factors 'other' than main temperature signal.
<br>
These 'factors' could be elevation, proximity to ocean, etc. that might be explaining the secondary variation in temperature readings.

In [12]:
# Stored as dataframe
print(type(temperature_matrix))

# Stored column names
print(temperature_matrix.columns)

<class 'pandas.core.frame.DataFrame'>
Index([1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11], dtype='int64', name='station_id')

In [13]:
# Readings for station 1
temperature_matrix.iloc[:,0].head()

timestamp
2004-01-01 00:30:00    46.0
2004-01-01 01:30:00    46.0
2004-01-01 02:30:00    45.0
2004-01-01 03:30:00    41.0
2004-01-01 04:30:00    39.0
Name: 1, dtype: float64

In [14]:
# Temperature Data without missing values
temperature_matrix.loc[:'2008-6-30 05:30:00',:]

station_id,1,2,3,4,5,6,7,8,9,10,11
timestamp,,,,,,,,,,,
2004-01-01 00:30:00,46.0,38.0,44.0,45.0,42.0,44.0,45.0,43.0,41.0,42.0,36.0
2004-01-01 01:30:00,46.0,36.0,42.0,43.0,42.0,43.0,44.0,44.0,39.0,43.0,32.0
2004-01-01 02:30:00,45.0,35.0,40.0,41.0,40.0,42.0,41.0,42.0,36.0,43.0,31.0
2004-01-01 03:30:00,41.0,30.0,36.0,37.0,39.0,38.0,40.0,34.0,35.0,39.0,30.0
2004-01-01 04:30:00,39.0,30.0,34.0,33.0,40.0,38.0,35.0,30.0,33.0,35.0,34.0
...,...,...,...,...,...,...,...,...,...,...,...
2008-06-30 01:30:00,74.0,65.0,76.0,72.0,74.0,70.0,73.0,71.0,72.0,70.0,65.0
2008-06-30 02:30:00,74.0,64.0,76.0,72.0,74.0,70.0,72.0,71.0,72.0,70.0,64.0
2008-06-30 03:30:00,74.0,64.0,75.0,72.0,73.0,70.0,71.0,71.0,69.0,70.0,64.0
2008-06-30 04:30:00,74.0,64.0,75.0,72.0,72.0,70.0,71.0,70.0,69.0,70.0,64.0
2008-06-30 05:30:00,75.0,63.0,74.0,71.0,72.0,68.0,71.0,71.0,69.0,70.0,64.0

Temperature readings available till 30 Jun 2008, 5:30 AM (i.e. hour 6).

In [15]:
# Checking which station is carrying missing values

for i in range(11):
    print(f'Missing Values in Station {i+1}: {sum(temperature_matrix.loc[:'2008-6-30 05:30:00'].isna().iloc[:,i])}')

Missing Values in Station 1: 0
Missing Values in Station 2: 0
Missing Values in Station 3: 0
Missing Values in Station 4: 0
Missing Values in Station 5: 0
Missing Values in Station 6: 0
Missing Values in Station 7: 0
Missing Values in Station 8: 0
Missing Values in Station 9: 0
Missing Values in Station 10: 0
Missing Values in Station 11: 0

Hence there are no missing values till 30 Jul 2008, 05:30:00.

In [16]:
# Calculating variance for each station_id
import numpy

for i in range(11):
    print(f'Variance for station {i+1} is: {numpy.nanvar(temperature_matrix.iloc[:,i])}')

Variance for station 1 is: 279.6953842020234
Variance for station 2 is: 303.0187789065871
Variance for station 3 is: 309.18441857963165
Variance for station 4 is: 302.2389678346821
Variance for station 5 is: 309.5590831777797
Variance for station 6 is: 291.3627644284706
Variance for station 7 is: 322.2223836627818
Variance for station 8 is: 315.2284430195869
Variance for station 9 is: 320.9430675178908
Variance for station 10 is: 302.8390846571321
Variance for station 11 is: 320.6891516464157

Variance Range: 279-322 <br>
Variation of temperatures within each station appear more or less similar. Hence, normalisation is not required.

In [17]:
# Temperature df without forecasting horizon
temperature_no_na = temperature_matrix.loc[:'2008-6-30 05:30:00',:]

In [18]:
# performing PCA
from sklearn.decomposition import PCA

temp_pca = PCA().fit(temperature_no_na)

[Reference for PCA](https://www.geo.fu-berlin.de/en/v/soga-py/Advanced-statistics/Multivariate-Approaches/Principal-Component-Analysis/PCA-in-Python/index.html)

In [19]:
# Eigenvector Matrix
print(f"Rotation matrix:\n{temp_pca.components_}")

Rotation matrix:
[[ 2.84886342e-01  2.99238328e-01  3.02111048e-01  2.99239971e-01
   3.00801214e-01  2.95065536e-01  3.11037378e-01  3.05925953e-01
   3.09547384e-01  3.01169382e-01  3.06721354e-01]
 [ 4.76202797e-01 -3.74990948e-01  4.05906721e-01  8.96605385e-02
   4.65044944e-01 -2.18014384e-01 -3.74265197e-02 -6.94108472e-02
  -1.22384503e-01 -2.45014403e-01 -3.38803336e-01]
 [ 1.23952168e-01 -2.16049683e-01 -2.17147684e-01  4.79035284e-01
  -2.96110299e-01  2.38171327e-01 -8.39667281e-02  4.63674759e-01
  -2.53176705e-01  2.15090431e-01 -4.29553901e-01]
 [-4.01806764e-01 -3.74133924e-01  3.45413850e-02 -1.21810221e-01
   2.45250048e-02 -8.15715112e-02  5.02674662e-01  1.71615786e-01
   5.19326357e-01  2.34204120e-02 -3.50580564e-01]
 [ 4.93525767e-01 -1.58993027e-01 -2.74869948e-01  1.73556537e-01
  -4.28766503e-01 -3.55725651e-01  2.63406211e-01  4.77919225e-03
   2.57288476e-01 -2.87287216e-01  3.11383599e-01]
 [ 4.55446021e-01  1.38183172e-01 -1.64072851e-01 -3.48167456e-01
  -1.44560526e-01  3.72817116e-01  1.74712994e-01 -4.37884254e-01
   1.40110144e-01  2.50356997e-01 -4.01082009e-01]
 [-2.40684126e-01  3.19458912e-02  2.45211120e-02  6.88223471e-01
   2.30602073e-05  1.75238279e-01  5.99196604e-02 -6.16053766e-01
   1.27867250e-01 -1.76596197e-01 -7.37595248e-02]
 [-1.95715371e-02  6.59327752e-02  7.60435845e-01 -4.70135097e-02
  -6.28340821e-01 -1.55831396e-02 -1.07259581e-01 -8.66641065e-03
   5.78390725e-02  9.83985199e-03 -6.87019215e-02]
 [-7.68865975e-02  9.26905629e-02  9.45842563e-02 -2.68576833e-02
  -5.96789713e-02 -3.02571291e-02  7.25449936e-01 -5.73654299e-02
  -6.61668659e-01 -4.92799411e-02  3.93699310e-02]
 [ 1.81837545e-03  7.24277220e-01 -7.30619242e-02  8.80727899e-02
   3.95236044e-02 -3.71382410e-01  2.51711416e-02  1.79395346e-01
   1.04211708e-01 -2.55565291e-01 -4.62436327e-01]
 [-5.68700126e-03 -1.65674213e-02 -9.22522492e-04  1.49738035e-01
   1.71669045e-02 -6.05558872e-01 -1.44615370e-02 -2.24296439e-01
  -3.48574696e-02  7.47137735e-01 -1.80757156e-02]]

In [20]:
import numpy as np
print(f"Standard deviation of each principal component:\n{np.sqrt(temp_pca.explained_variance_)}")

Standard deviation of each principal component:
[57.35763386  6.02736089  4.76811038  3.03132175  2.40946791  2.25242803
  1.58693736  1.47207933  1.25294485  1.16504602  0.65162993]

In [21]:
print(f"Proportion of variance explained by each principal component:\n{np.round(temp_pca.explained_variance_ratio_, 3)}")

Proportion of variance explained by each principal component:
[0.974 0.011 0.007 0.003 0.002 0.002 0.001 0.001 0.    0.    0.   ]

PC1 is most essential and explains 97% of total variation in temperature. PC2 only explains about 1%.

Hence a single PC can strongly capture the broad temperature signal, with assigning suitable weights that maximise explained variance.

In [22]:
# Weight assignment to each station by PC 1
print(temp_pca.components_[0])
print(f'Sum of weights: {sum(temp_pca.components_[0])}')

[0.28488634 0.29923833 0.30211105 0.29923997 0.30080121 0.29506554
 0.31103738 0.30592595 0.30954738 0.30116938 0.30672135]
Sum of weights: 3.315743891550456

Weights are actually closer together in sign and magnitude. This suggests that there are no stations that are contrasting with others or have extreme readings, most of them appear to move together.

In [23]:
# Re-scaling weights
weights_normalised = temp_pca.components_[0]/sum(temp_pca.components_[0])
print(weights_normalised)
print(f'Sum of normalised weights: {sum(weights_normalised)}')

[0.08591928 0.09024772 0.09111411 0.09024822 0.09071907 0.08898924
 0.09380621 0.09226465 0.09335684 0.09083011 0.09250454]
Sum of normalised weights: 1.0000000000000002

In [24]:
# Matrix Multiplication using normalised weights
temperature_no_na["temp_weighted"] = temperature_no_na.dot(weights_normalised)
temperature_no_na.head()

C:\Users\singh\AppData\Local\Temp\ipykernel_7380\1320693677.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  temperature_no_na["temp_weighted"] = temperature_no_na.dot(weights_normalised)

station_id,1,2,3,4,5,6,7,8,9,10,11,temp_weighted
timestamp,,,,,,,,,,,,
2004-01-01 00:30:00,46.0,38.0,44.0,45.0,42.0,44.0,45.0,43.0,41.0,42.0,36.0,42.338937
2004-01-01 01:30:00,46.0,36.0,42.0,43.0,42.0,43.0,44.0,44.0,39.0,43.0,32.0,41.239284
2004-01-01 02:30:00,45.0,35.0,40.0,41.0,40.0,42.0,41.0,42.0,36.0,43.0,31.0,39.591442
2004-01-01 03:30:00,41.0,30.0,36.0,37.0,39.0,38.0,40.0,34.0,35.0,39.0,30.0,36.243296
2004-01-01 04:30:00,39.0,30.0,34.0,33.0,40.0,38.0,35.0,30.0,33.0,35.0,34.0,34.600850

In [25]:
# Exporting
temperature_no_na.to_csv("weighted_temperature.csv", index=True)